
// Створити скрипт для додавання, віднімання, множення та поділу двох чисел та виведення результатів.

// const p = +prompt('Введіть перше число');
// console.log(p);
// const i = +prompt('Введиіт друге число');
// console.log(i);
// let q = p + i;
// alert('Сума цих чисел буде = ' + q);
// let w = p - i;
// alert('Різниця першого та другого чиел буде = ' + w);
// let e = p * i;
// alert('При множенні числа дадуть результат, що = ' + e);
// let r = p / i;
// alert('При діленні буде ' + r);


// Напишіть скрипт, який переводить години в секунди

// const a = +prompt('Котра година?','16');
// console.log(a);
// let b = a * 60 * 60;
// alert('В ' + a + ' годинах, буде ' + b + ' секунд.');


// Створити скрипт який має визначити середнє арифметичне трьох чисел

let a = +prompt('Введіть 1-ше число', '5');
console.log(a);
let b = +prompt('Введіть 2-ге число', '34');
console.log(b);
let c = +prompt('Введіть 3-тє число', '937');
console.log(c);
let d = (a + b + c)/3;
alert('Середнє арифметичне трьох чисел буде = ' + d);
