'use strict';

// Объявите две переменные: admin и name.
// Запишите строку "Джон" в переменную name.
// Скопируйте значение из переменной name в admin.
// Выведите на экран значение admin, используя функцию alert (должна показать «Джон»).

// let admin;
// let name;
// name = 'Джон';
// admin = name;
// alert(admin);



// Создайте переменную для названия нашей планеты. Как вы ее назовете?
// Создайте переменную для хранения имени текущего посетителя сайта. Как бы вы назвали такую переменную?

// let planetEarth;
// let visitor001Ads28022023;



// Создать переменную и сохранить в нее значение '10' (строка) + 10 (число), проверить ее тип и вывести его в консоль, изучить вопрос почему именно так все работает.

let number = '10' + 10;
console.log(number);
console.log(typeof number);

